# 1.Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

abc = input('Введите трехзначное число:')

print(int(abc[0]) + int(abc[1]) + int(abc[2]))
print(int(abc[0]) * int(abc[1]) * int(abc[2]))
